import React, { Component } from 'react'
import { Container, Col, Row, Button, Form, FormGroup, Label, Input, FormText } from 'reactstrap'
import '../node_modules/bootstrap/dist/css/bootstrap.min.css'
import './App.css'
export default class App extends Component {
	state = { data: [], olddata: 'โกโก้,ชาเขียว,โกโก้,ชาเขียว,โกโก้,กาแฟ', check: true ,lenght:'' }
	componentDidMount = () => {
		this.cal()
		document.title = 'Top 5 Charkon'
	}
	cal = () => {
		var res = this.state.olddata.split(',')
		console.log('res is ', res)
		let counts = res.reduce((map, fruit) => {
			map[fruit] = (map[fruit] || 0) + 1
			return map
		}, {})
		let len = res.length
		console.log('counts : ', counts)
		let sorted = Object.keys(counts).sort((a, b) => counts[b] - counts[a])
		let top5 = sorted.slice(0, 5)
		this.setState({ data: top5, check: true , lenght:len })
		console.log('top 5 is ', top5)
	}
	handleChange = e => {
		const { id, value, name } = e.target
		this.setState({ [name]: value })
		console.log({ [name]: value })
		clearTimeout(this.timer)
		this.timer = setTimeout(() => this.cal(), 300)
	}

	setNew = () => {
		let newdata =
			'ชานม,โอวันติน,ชาเขียว,มะขามเปรี้ยว,ชามัชชะ,ชาเย็น,ชาเขียว,ชานม,ชามะลิ,สตอเบอรี่,ชาเย็น,ชาเขียว,ชาเขียว,เก็กฮวย,ชาเย็น,นมเย็น,ชาเย็น,นมสด,ชาเย็น,ชาเย็น,โกโก้ร้อน,ชามะนาว,ชาเย็น,ชาเย็น,ชาเย็น,โกโก้,ชาเย็น,ชาเย็น,ชาเขียว,นมสด,กาแฟโบราณ,ชาเย็น,ชาเย็น,ชาเย็น,ชานม,โกโก้,ชาเย็น,ชาเย็นเย็น,คาราเมล,ชานม,ชามะลิ,ชาเย็น,น้ำผึ้งมะนาว,โกโก้คอน,ชาเย็น,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,ชามะลิ,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,นมคาราเมล,กาแฟ,โอวัลติน,ชานม,ชาเย็น,ชาเย็น,ชาเย็น,ชาเขียว,ชาเขียว,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,กาแฟเย็น,กาแฟเย็น,ลาเต้,ชาเย็น,นมมอลต์,ชาคอน,ชาคอน,ชาเขียว,เขียวโซดา,ชามะนาว,ชามะนาว,ชามะลิ,โกโก้,ชาเย็น,ชาเย็น,ชาเย็น,มอคค่า,โกโก้,สตอเบอรี่,นมน้ำผึ้ง,นมน้ำผึ้ง,ชาคอน,ชาคอน,ชาร้อน,แดงมะนาวโซดา,ชาเย็น,ชามะลิ,ชานม,ชาคอน,โกโก้,โอวันติน,ชาเขียวหวานน้อย,มะขามเปรี้ยว,ชามัชชะ,ชาเย็น,ชาเขียว,ชานม,ชามะลิ,สตอเบอรี่,ชาเย็น,ชาเขียว,ชาเขียว,เก็กฮวย,ชาเย็น,นมเย็น,ชาเย็น,นมสด,ชาเย็น,ชาเย็น,โกโก้ร้อน,ชามะนาว,ชาเย็น,ชาเย็น,ชาเย็นโกโก้,ชาเย็น,ชาเย็น,ชาเขียว,นมสด,กาแฟโบราณ,ชาเย็น,ชาเย็น,ชาเย็น,ชานม,โกโก้,ชาเย็น,ชาเย็นเย็น,คาราเมล,ชานม,ชามะลิ,ชาเย็น,น้ำผึ้งมะนาว,โกโก้คอน,ชาเย็น,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,โกโก้,ชามะลิ,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,นมคาราเมล,กาแฟ,โอวัลติน,ชานม,ชาเย็น,ชาเย็น,ชาเย็น,ชาเขียว,ชาเขียว,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,ชาคอน,กาแฟเย็น,กาแฟเย็น,ลาเต้,ชาเย็น,นมมอลต์,ชาคอน,ชาคอน,ชาเขียว,เขียวโซดา,ชามะนาว,ชามะนาว,ชามะลิ,โกโก้,ชาเย็น,ชาเย็น,ชาเย็น,มอคค่า,โกโก้,สตอเบอรี่,นมน้ำผึ้ง,นมน้ำผึ้ง,ชาคอน,ชาคอน,ชาร้อน,แดงมะนาวโซดา,ชาเย็น,ชามะลิ,ชานม,ชาคอน,โกโก้,ชาคอน,ชามะลิ,ชามะลิ,ชาเย็น,ชาขียว,โกโก้,เเดงมะลิ,โกโก้,นมสด,ชานม,ชาคอน,กาแฟร้อน,ชาคอน,โกโก้คอน,กาแฟเย็น,ยกล้อ,ชาคอน,ชาเย็น,โอวัลติน,ชานม,โกโก้,ชานม,โอวัลติน,ชามะลิ,ชามะลิ,โกโก้,ชาสด,ชาคอน,ชามะลิ,ชามะลิ,ชามะลิ,ชามะลิ,โบราณ,โบราณ,ชามะลิ,คาราเมล,ชา,ชาดำ,ชาเย็น,กาแฟ,แดงมะนาว,แดงมะนาว,แดงมะนาว,ชา,ชาดำ,โอวัลติน,โกโก้คอน,แฟร้อน,ชานม,กาแฟ,คาราเมล,โกโก้,โกโก้,ชาคอน,น้ำผึ้งมะนาว,แดงมะนาว,ชาคอน,กาแฟ,โกโก้,โกโก้,ชามะลิ,แดงมะนาว,ชา,ชาคอน,ชา,ชา,ชา,เขียวมะนาวโซดา,โกโก้,ชามะลิ,ชาร้อน,ชาเย็น,ชาเย็น,ชาเย็น,ชามะลิ,โกโก้,คาราเมล,กาแฟ,คาราเมล,ชาคอน,ชานม,ชาเย็น,ชามะลิ,ชาคอน,ชาคอน,โกโก้,ชาเย็น,ชาเย็น,โอเลี้ยง,โกโก้,ชาเขียว,กาแฟ,ชาเขียวดำ,ชานม,ชาเขียว,ชา,ชาเขียว,โกโก้,ชานม,โกโก้,ชาเย็น,ชาคอน,ชามะลิ,โกโก้,ชาเขียว,คาราเมล,โกโก้,ชาคอน,ชา,ชาคอน,ชานม,ชามะลิ,ชานม,ชา,ชาคอน,ชามะลิ,เผือก,ชาเย็น,ชามะลิ,โกโก้,โกโก้,ชาคอน,ชามะลิ,ชาเขียว,ชา,ชา,ชามะลิ,ชาเขียว,ชานม,โกโก้คอน,ชาเย็น,ชาเย็น,ชาเย็น,ชามะลิ,โกโก้,คาราเมล,กาแฟ,คาราเมล,ชาคอน,โกโก้,ชา,ชานม,ชาเย็น,ชามะลิ,ชา,ชาเย็น,ชาเย็น,กาแฟ,โกโก้,นมสด,โกโก้,ชาเย็น,ชาคอน,ชาดำ,นมเย็น,ชา,ชาเย็น,ชาเย็น,โกโก้,ชามะลิ,ไมโล,ชาเขียว,ชา,กาแฟ,ชาเขียว,ชาเย็น,ชาเขียว,ชาเขียว,ชามะลิ,ม็อคค่า,โกโก้,ชา,ชา,โกโก้,โกโก้,ชาคอน,ชาเขียว,ชาคอน,ชาเย็น,ชาเขียว,โกโก้,ชานม,ชาคอน,ชาเขียว,ชา,ชาเย็น,ชา,ชา,ชา,ชา,ม็อคค่า,ชาคอน,โกโก้คอน,ลิ้นจี่,ชา ,ม็อคค่า,โกโก้,ชาคอน,โอเลี้ยง,ชา,เผือก,ชาเย็น,ชาเย็นมะลิ,ชา,ชาคอน,ชามะลิ,ชานม,ชา,โกโก้,ชามะลิ,ชานม,ชา,ชา,ชาเย็นมะลิน้ำผึ้ง,บลูเบอร์รี่,นมคาราเมล,ชา,ชานม,ชาคอน,ชาคอน,ชา,ชาเย็น,ชา,ชานม,ชา,ลิ้นจี่,ชา,ชา,ชา,ชา,ชาเย็น,ชานม,ชาเย็น,ชาเย็น,ชามะลิ,นมเย็น,มะนาวโซดา,ชาเย็น,นมเย็น,ชาเย็น,ชาเย็น,ชานม,นมสด,ชามะลิ,ชาเย็น,ชานม,ชามะลิ,ชามุก,น้ำผึ้งมะนาวโซดา,แดงมะนาวโซดา,ชาดำ,นมผึ้ง,ชาเผือก,ชานม,สตอเบอร์รี่โซดา,กาแฟ,มอคค่า,ชาเผือก,กาแฟคอน,ชาเย็น,กาแฟ,ชามะลิ,ชาเย็น,ชานม,ชาเย็น,ชาเย็น,โกโก้,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,แดงมะนาวโซดา,กาแฟ,โกโก้,กาแฟ,โกโก้,ชามะลิ,ชาดำ,ชาเย็น,โกโก้,โกโก้,ชาเย็น,ชาเย็น,โกโก้,ชาเย็น,ชาเย็น,โกโก้คอน,ชานม,แดงมะนาวโซดา,ชาเย็น,ชามะลิ,ชานม,ชาเย็น,นมสดคาลเมล,เขียวโซดา,โกโก้,โอวัลติน,ชาเย็น,นมคาลเมล,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเย็น,ชาเขียว,เขียวโซดา,เขียวโซดา,เขียวโซดา,เขียวโซดา,ชาเย็น,ชานม,ชาเขียว,ชาไต้หวัน,ชาคอน,นมเมาล์,นมหมี,ชานมมะลิ,ชาเขียว,นมเย็น,ชาเย็น,โอวัลติน,ชามะลิ,โกโก้,นมน้ำผึ้ง,โอวัลติน,โกโก้มุก,ชานม,ชานม,ชาเย็น,โกโก้,แดงมะนาวโซดา,ชาเย็น,กาแฟเย็น,กาแฟโบราณ,ชาเขียว,น้ำกีวี่,ชาเย็น,นมเย็น,ชาเขียวคอน,โกโก้,นมคาลเมล,โกโก้คอน,ชาคร,ชาเขียวคอนม,โกโก้,นมคาเมล,นมคาเมล,นมคาเมล,โกโก้,นมคาเมล,ชาดำ,ชาเย็น,โกโก้,ชาเขียว,นมเมาล์,ชาเย็น,โกโก้,ชาดำม,ชาเย็น,ชาดำ,นมมะลิ,แดงมะนาวโซดา,โกโก้1ถุง,ชาเย็น1ถุง,โกโก้,ชาเย็น,ชาเขียวคอน,นมเย็น,ชาเขียว,โกโก้,มอคค่า,โกโก้,ชาเย็น,แดงมะาวโซดา,แดงมะนาวโซดาวโซดา,ชาคอน,ชามะลิ, คอน,ขาคอน,โกโก้,ชาคอน,ชาคอน,ชาคอน,ชาเขียวคอน,ชาเย็น,ชาเขียวคอน,ชามะลิ,โกโก้คอน,ชาเย็น,ชาคอน,เผือก,ชาเย็น,ชาเขียว,ชาเขียว,กาแฟ,ชาคอน,ชานม,มอคค่า,นมคาเมล,บ๋วยโซดา,นมคาเมลทอง,โอวัลติน,ชาเขียว,สตอรเบอร์รี่โซดา,โกโก้เย็น,ชาเย็น,กาแฟเย็น,คาราเมลหวาน,ชาเย็น,ชามะลิ,ชามะลิ,ชาเย็น,ชาเขียวเย็น,ชาดำเย็น,ชานม,โกโก้,โกโก้,ชานมเย็น,กาแฟเย็น,ชาเย็น,ชานม,คาราเมล,ชามะลิ,ชามะลิ,ชามะลิ,ชาเย็น,ชาคอน,โกโก้,เขียวโซดา,ชาคอน,ชาเย็น,ชานม,ชาคอน,โกโก้,คาราเมล,โกโก้,ชาคอน,โกโก้,ชาเขียว,ชาเขียว,คาราเมล,ชาเย็น,โอเลี้ยง,ชาเขียว,โกโก้,ชาเขียวสอง,โกโก้,โกโก้,ชานม,ชาดำ,ชามะลิ,ชาเย็น,ชาคอน,ชาเขียว,ชาคอน,ชาเย็น,โกโก้,ชาเย็น,โกโก้,ชามะลิ,ชานม,ชานม,โกโก้,ชาเย็น,คาราเมลเย็น,ชาเย็น,โกโก้,กาแฟเย็น,ชาเย็น,โกโก้,กาแฟเย็น,ชาเขียว,ชามะลิ,ชามะลิ,ชานม,กาแฟเย็น,โกโก้,ชาเย็น,แดงโซดา,ชานม,โกโก้เข้มเข้ม,กาแฟเย็น,ชานม,โอเลี้ยงเย็น,ชานมเย็น,โกโก้,โกโก้,ชาเย็น,ชาเขียว,ชาเย็น,กาแฟ,โอเลี้ยงเย็น,ชาเย็น,ถ้าเขียวหวานน้อย,โกโก้,โกโก้,ชามะลิหวานน้อย,ชานม,โกโก้,ชาคอน,ไม่โลเย็น,แดง,มะนาวโซดา,ชาคอน,ชานมสอง,กลัว,ชาเย็น,ชาเย็น,ชาเย็น,โกโก้หวานน้อย,โกโก้หวานน้อย,ชาเขียวใส่ถุง,ชาคอน,โกโก้หวานน้อย,ชาเย็น'


			this.setState({ olddata: newdata, check: true })
		setTimeout(() => this.cal(), 300)
		// this.cal()
	}
	setClear = () => {
		let newdata = ['']
		this.setState({ data: newdata, olddata: newdata, check: false   , lenght:0})
	}
	render() {
		return (
			<Container className="p-5">
				<Row>
					<Col>
						<div>
							<h3 style={{ textAlign: 'center' }} className="mt-5 mb-5">
								Asignment 1 240-420 Web Engineering and Applications
							</h3>
							<h3 style={{ textAlign: 'center' }} className="mt-3 mb-3">
								5 อันดับเมนูยอดนิยมของร้านชาคอน !
							</h3>

							<div style={{ fontSize: 26 }}>เมนูทั้งหมด ({this.state.lenght}) !</div>
							<Form className="form-group">
								<Input
									id="input"
									type="textarea"
									className=" form-control outline-effect mt-3"
									name="olddata"
									style={{ width: '100%', height: '250px', fontSize: 18, color: '#fff' }}
									onChange={this.handleChange}
									value={this.state.olddata}
									placeholder="please fill input"
								/>
							</Form>
						</div>
						<div>
							<Button color="success" className="mr-2" onClick={this.setNew}>
								Data From Charkon
							</Button>
							<Button color="danger" onClick={this.setClear}>
								Clear Data
							</Button>
						</div>
					</Col>
				</Row>
				<Row>
					<Col>
						<div className="mt-5 mb-5">
							<div style={{ fontSize: 26 }}>Top 5 ชาคอน ได้แก่</div>
							{this.state.check &&
								this.state.data.map((e, index) => (
									<div key={index} style={{ fontSize: 22 }}>
										{index + 1}. {e}{' '}
									</div>
								))}
							{!this.state.check &&
								this.state.data.map((e, index) => (
									<div key={index} style={{ fontSize: 22 }}>
										&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; . . . no data . . .
									</div>
								))}
						</div>
					</Col>
				</Row>
				<Row className="mt-2">
					<Col>
						<h4>หลักการ</h4>
						<p>
							&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ฐานนิยม (อังกฤษ: Mode) เป็นมัชฌิมประเภทหนึ่ง
							ซึ่งเลือกมาจากข้อมูลที่มีการซ้ำกันมากที่สุด ข้อมูลที่ซ้ำกันมากที่สุด ของ 20 25 45 45 45 55 25 30 30 60 คือ 45 (ซ้ำกันสามค่า
							ซึ่งมากที่สุด) ค่าฐานนิยม = 45 ดังนั้น ฐานนิยมของอายุคนกลุ่มนี้คือ 45 ปี
						</p>
						ที่มา :<a href="https://th.wikipedia.org/wiki/%E0%B8%90%E0%B8%B2%E0%B8%99%E0%B8%99%E0%B8%B4%E0%B8%A2%E0%B8%A1"> Wikipedia</a>
					</Col>
				</Row>
			</Container>
		)
	}
}
